#какви разходи ще има Джеси, ако започне да тренира,
#като знаете колко е таксата за тренировки по баскетбол за период от 1 година
#•	Баскетболни кецове – цената им е 40% по-малка от таксата за една година
#•	Баскетболен екип – цената му е 20% по-евтина от тази на кецовете
#•	Баскетболна топка – цената ѝ е 1 / 4 от цената на баскетболния екип
#•	Баскетболни аксесоари – цената им е 1 / 5 от цената на баскетболната топка
#INPUT Годишната такса за тренировки по баскетбол – цяло число в интервала [0… 9999]
yearly_tax = int(input())
shoes = yearly_tax - (yearly_tax * 0.40)
clothing = shoes - (shoes * 0.20)
ball = clothing / 4
accessories = ball / 5
total_cost = yearly_tax + shoes + clothing + ball + accessories
print(float(total_cost))
