#програма, която извежда на конзолата номерата на стаите в една сграда (в низходящ ред), като са изпълнени
# следните условия:
# •	На всеки четен етаж има само офиси;
# •	На всеки нечетен етаж има само апартаменти;
# •	апартамент  : А{номер на етажа}{номер на апартамента}, номерата на апартаментите започват от 0;
# •	офис : О{номер на етажа}{номер на офиса}, номерата на офисите също започват от 0;
# •	На последният етаж  апартаменти и те са по-големи от останалите 'L', вместо 'А'.
# Ако има само един етаж, то има само големи апартаменти!
#две цели числа - броят на етажите и броят на стаите за един етаж. A 1 0 A11 A12 A13
floors = int(input())
rooms = int(input())

for floor in range(floors , 0, -1):  # обхождаме етажите отгоре надолу
    for room in range(rooms):
        if floor == floors:  # последният (най-горен) етаж
            print(f"L{floor}{room}", end=' ')
        elif floor % 2 == 0:
            print(f"O{floor}{room}", end=' ')
        else:
            print(f"A{floor}{room}", end=' ')
    print()  # нов ред след всяко ниво