#Да се напише програма, която чете едно цяло число N, въведено от потребителя, и генерира всички възможни
# "специални" числа от 1111 до 9999. За да бъде “специално”  то трябва да отговаря на следното условие:
# •	N да се дели на всяка една от неговите цифри без остатък.
# Пример: при N = 16, 2418 е специално число:
# •	16 / 2 = 8 без остатък  # •	16 / 4 = 4 без остатък
# •	16 / 1 = 16 без остатък  # • 16 / 8 = 2 без остатък
#да се отпечатат всички “специални” числа, разделени с интервал
# Четем входа от потребителя
start_number = int(input())
# Обхождаме всички 4-цифрени числа от 1111 до 9999
for number in range(1111, 10000):
    is_special = True
    for digit_char in str(number):
        digit = int(digit_char)
        if digit == 0 or start_number % digit != 0:
            is_special = False
            break
    if is_special:
        print(number, end=' ')