#да изчисли колко часа на ден трябва да отделя, за да прочете необходимата литература.
#1.	Брой страници в текущата книга – цяло число в интервала [1…1000]
#2.	Страници, които прочита за 1 час – цяло число в интервала [1…1000]
#3.	Броят на дните, за които трябва да прочете книгата – цяло число в интервала [1…1000]
#Да се отпечата на конзолата броят часове, които Жоро трябва да отделя всеки ден.
pages = int(input())
pages_per_hour = int(input())
days_for_reading = int(input())
#hours_per_day
total_hours = pages / pages_per_hour
hours_per_day = total_hours / days_for_reading
print(int(hours_per_day))