#Напишете програма, която пресмята нужните разходи за закупуването на храна
#една опаковка храна за кучета е на цена 2.50 лв, а
# опаковка храна за котки струва 4 лв. Input:
#1.	Броят на опаковките храна за кучета – цяло число в интервала [0… 100]
#2.	Броят на опаковките храна за котки –  цяло число в интервала [0… 100]
#Output: "{крайната сума} lv."
dog_food_count = int(input())
cat_food_count = int(input())
dog_food_total = dog_food_count * 2.50
cat_food_total = cat_food_count * 4
print(f"{dog_food_total + cat_food_total} lv.")