# Дадено е цяло число – начален брой точки. Върху него се начисляват бонус точки
# Да се напише програма, която пресмята бонус точките,
# които получава числото и общия брой точки (числото + бонуса).
# •	Ако числото е до 100 включително, бонус точките са 5;
# •	Ако числото е по-голямо от 100, бонус точките са 20% от числото;
# •	Ако числото е по-голямо от 1000, бонус точките са 10% от числото.
# •	Допълнителни бонус точки (начисляват се отделно от предходните):
# o	За четно число  + 1 т.
# o	За число, което завършва на 5  + 2 т.
#5.	Принтирайте на два реда резултатите. На първия ред натрупания бонус, а на втория
# - крайното число, което ще намерите, като съберете началния брой точки и бонуса.
points = int(input())
bonus_points = 0
if points <= 100:
    bonus_points += 5
elif points <= 1000:
    bonus_points += 20 * 1 /100 * points
else:
    bonus_points += 10 * 1 / 100 * points

if points % 2 == 0:
        bonus_points += 1
elif points % 10 == 5:
        bonus_points += 2
print(bonus_points)
print(f"{bonus_points + points}")